/*
1. Продумать, где можно применить замыкания для практикума из седьмого урока.
Не успел посмотреть всё к указанной дате :( очень хотел бы конечно проверку этого задания...
Из самостоятельного задания 7 урока, то что в памяти лучше всего сохранилось, "счет побед" - наверное можно сделать универсальный счетчик, который выполняет, например +1. И вставлять эту функцию туда.

Но в замыканиях надо поковыряться еще... Например я не понимаю можно/нужно задавать для таких функций данные на вход, и, грубо говоря, получать на выходе объект сразу содержащий и вводные параметры и результат расчёта функции...


2. Не выполняя код, ответить, что выведет браузер и почему:
a. Выведет 1. Если "a" нет в области window, то сделай переменную "a" и присвой значение 1.
b. ошибка. браузер не увидит "a" в области window т.к. функция объявленв не глобально а внутри b (expression declaration)
c. выведет андефайнд. после функциии объявлена глобальная переменная "a", не присвоено значение. выведется переменная а.
d. выведет 10. в функции третьму по счёту аргументу функции (параметр "a") присваивается значение 10.

*/
